In [1]:
%load_ext sql

In [2]:
%sql sqlite:///C:\Users\bilene\Downloads\book.db

In [6]:
output = %sql SELECT * FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

In [7]:
type(output)

sql.run.ResultSet

In [8]:
import pandas as pd
df = pd.DataFrame(output)
df

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [19]:
%%sql
output2 <<
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.
Returning data to local variable output2

In [20]:
pd.DataFrame(output2) # notice the output has only 5 rows stored

   year code   pop   gdp  life  cell  imports  exports
0  1960  ABW  0.05   NaN  65.7   0.0      NaN      NaN
1  1960  AFG  9.00  0.54  32.3   0.0      NaN     49.9
2  1960  AGO  5.45   NaN  33.3   0.0    127.5    123.3
3  1960  ALB  1.61   NaN  62.3   0.0      NaN      NaN
4  1960  AND  0.01   NaN   NaN   0.0      NaN      NaN

In [22]:
%%sql
-- Here is a one-line comment
/* Here is a multi-line comment
which continues here
and ends here */
SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [24]:
%%sql
SELECT name FROM sqlite_master
WHERE type='table'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [25]:
%%sql
--Explore tables
SELECT * FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [26]:
%%sql
--Explore tables
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None)]

In [4]:
%%sql
SELECT * FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1880, 'Male', 'John', 9655),
 (1881, 'Female', 'Mary', 6919),
 (1881, 'Male', 'John', 8769),
 (1882, 'Female', 'Mary', 8148)]

In [7]:
%%sql
-- what if you want to return only year and name columns in topnames?
SELECT year, name FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Mary'),
 (1880, 'John'),
 (1881, 'Mary'),
 (1881, 'John'),
 (1882, 'Mary')]

In [8]:
%%sql
-- changing column names?
SELECT year AS myyear, name AS babyname FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Mary'),
 (1880, 'John'),
 (1881, 'Mary'),
 (1881, 'John'),
 (1882, 'Mary')]

In [10]:
%%sql
-- filter the data to years post 2000 (2000 included)
SELECT * FROM topnames
WHERE year>=2000
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [17]:
%%sql
-- two conditions? return female baby names from post 2000 (including 2000)
-- python you use "&" for and; in SQL it is "AND"
-- python you use "|" for or; in SQL it is "OR"
SELECT * FROM topnames
WHERE year>=2000 AND sex='Female'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037)]

In [20]:
%%sql
-- more than two conditions?
-- return baby names post 2000 (included) and only the names "James" or "Emily"
SELECT * FROM topnames
WHERE year>=2000 AND (name='James' OR name='Emily')

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037),
 (2005, 'Female', 'Emily', 23940),
 (2006, 'Female', 'Emily', 21404),
 (2007, 'Female', 'Emily', 19355)]

In [21]:
%%sql
-- do the same using the "isin()" approach from pandas
SELECT * FROM topnames
WHERE year>=2000 AND name IN ('James','Emily')

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2001, 'Female', 'Emily', 25057),
 (2002, 'Female', 'Emily', 24464),
 (2003, 'Female', 'Emily', 25691),
 (2004, 'Female', 'Emily', 25037),
 (2005, 'Female', 'Emily', 23940),
 (2006, 'Female', 'Emily', 21404),
 (2007, 'Female', 'Emily', 19355)]

In [26]:
%%sql
-- not equals in SQL?
-- return baby names that are not "John"
SELECT * FROM topnames
WHERE name != 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [27]:
%%sql
-- SQL way of doing it
SELECT * FROM topnames
WHERE name <> 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [28]:
%%sql
-- SQL way of doing it v2
SELECT * FROM topnames
WHERE name IS NOT 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1881, 'Female', 'Mary', 6919),
 (1882, 'Female', 'Mary', 8148),
 (1883, 'Female', 'Mary', 8012),
 (1884, 'Female', 'Mary', 9217)]

In [30]:
%%sql
-- return for years between 2000 and 2010
SELECT * FROM topnames
WHERE year<=2010 AND year>=2000
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [31]:
%%sql
-- SQL way of doing it
SELECT * FROM topnames
WHERE year BETWEEN 2000 AND 2010
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(2000, 'Female', 'Emily', 25956),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Female', 'Emily', 25057),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Female', 'Emily', 24464)]

In [36]:
%%sql
-- return baby names that start with "J"
SELECT * FROM topnames
WHERE name LIKE "J%"

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1880, 'Male', 'John', 9655),
 (1881, 'Male', 'John', 8769),
 (1882, 'Male', 'John', 9557),
 (1883, 'Male', 'John', 8894),
 (1884, 'Male', 'John', 9388),
 (1885, 'Male', 'John', 8756),
 (1886, 'Male', 'John', 9026),
 (1887, 'Male', 'John', 8110),
 (1888, 'Male', 'John', 9247),
 (1889, 'Male', 'John', 8548),
 (1890, 'Male', 'John', 8502),
 (1891, 'Male', 'John', 7680),
 (1892, 'Male', 'John', 9039),
 (1893, 'Male', 'John', 8049),
 (1894, 'Male', 'John', 8238),
 (1895, 'Male', 'John', 8320),
 (1896, 'Male', 'John', 8138),
 (1897, 'Male', 'John', 7550),
 (1898, 'Male', 'John', 8159),
 (1899, 'Male', 'John', 6990),
 (1900, 'Male', 'John', 9829),
 (1901, 'Male', 'John', 6900),
 (1902, 'Male', 'John', 7907),
 (1903, 'Male', 'John', 7608),
 (1904, 'Male', 'John', 8108),
 (1905, 'Male', 'John', 8060),
 (1906, 'Male', 'John', 8265),
 (1907, 'Male', 'John', 8983),
 (1908, 'Male', 'John', 9342),
 (1909, 'Male', 'John', 9591),
 (1910, 'Male', 'John', 11450),
 (1911, 'Male', 'John', 13446),
 (1912, 'Male', 'John', 24587),
 (1913, 'Male', 'John', 29329),
 (1914, 'Male', 'John', 37948),
 (1915, 'Male', 'John', 47576),
 (1916, 'Male', 'John', 50043),
 (1917, 'Male', 'John', 51853),
 (1918, 'Male', 'John', 56558),
 (1919, 'Male', 'John', 53528),
 (1920, 'Male', 'John', 56913),
 (1921, 'Male', 'John', 58217),
 (1922, 'Male', 'John', 57277),
 (1923, 'Male', 'John', 57470),
 (1940, 'Male', 'James', 62473),
 (1941, 'Male', 'James', 66736),
 (1942, 'Male', 'James', 77176),
 (1943, 'Male', 'James', 80261),
 (1944, 'Male', 'James', 76951),
 (1945, 'Male', 'James', 74449),
 (1946, 'Male', 'James', 87436),
 (1947, 'Male', 'James', 94757),
 (1948, 'Male', 'James', 88584),
 (1949, 'Male', 'James', 86857),
 (1950, 'Male', 'James', 86224),
 (1951, 'Male', 'James', 87261),
 (1952, 'Male', 'James', 87063),
 (1970, 'Female', 'Jennifer', 46157),
 (1971, 'Female', 'Jennifer', 56783),
 (1972, 'Female', 'Jennifer', 63603),
 (1973, 'Female', 'Jennifer', 62447),
 (1974, 'Female', 'Jennifer', 63114),
 (1975, 'Female', 'Jennifer', 58183),
 (1976, 'Female', 'Jennifer', 59474),
 (1977, 'Female', 'Jennifer', 58964),
 (1978, 'Female', 'Jennifer', 56321),
 (1979, 'Female', 'Jennifer', 56717),
 (1980, 'Female', 'Jennifer', 58375),
 (1981, 'Female', 'Jennifer', 57049),
 (1982, 'Female', 'Jennifer', 57117),
 (1983, 'Female', 'Jennifer', 54346),
 (1984, 'Female', 'Jennifer', 50559),
 (1985, 'Female', 'Jessica', 48347),
 (1986, 'Female', 'Jessica', 52677),
 (1987, 'Female', 'Jessica', 55994),
 (1988, 'Female', 'Jessica', 51543),
 (1989, 'Female', 'Jessica', 47884),
 (1990, 'Female', 'Jessica', 46475),
 (1993, 'Female', 'Jessica', 34987),
 (1994, 'Female', 'Jessica', 32117),
 (1995, 'Female', 'Jessica', 27938),
 (1999, 'Male', 'Jacob', 35363),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [39]:
%%sql
-- return baby names that start with "J" and end with "A"
SELECT * FROM topnames
WHERE name LIKE "J%A"

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1985, 'Female', 'Jessica', 48347),
 (1986, 'Female', 'Jessica', 52677),
 (1987, 'Female', 'Jessica', 55994),
 (1988, 'Female', 'Jessica', 51543),
 (1989, 'Female', 'Jessica', 47884),
 (1990, 'Female', 'Jessica', 46475),
 (1993, 'Female', 'Jessica', 34987),
 (1994, 'Female', 'Jessica', 32117),
 (1995, 'Female', 'Jessica', 27938)]

In [43]:
%%sql
-- return baby names that start with "J" that are 5 characters long
SELECT * FROM topnames
WHERE name LIKE 'J____'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1940, 'Male', 'James', 62473),
 (1941, 'Male', 'James', 66736),
 (1942, 'Male', 'James', 77176),
 (1943, 'Male', 'James', 80261),
 (1944, 'Male', 'James', 76951),
 (1945, 'Male', 'James', 74449),
 (1946, 'Male', 'James', 87436),
 (1947, 'Male', 'James', 94757),
 (1948, 'Male', 'James', 88584),
 (1949, 'Male', 'James', 86857),
 (1950, 'Male', 'James', 86224),
 (1951, 'Male', 'James', 87261),
 (1952, 'Male', 'James', 87063),
 (1999, 'Male', 'Jacob', 35363),
 (2000, 'Male', 'Jacob', 34477),
 (2001, 'Male', 'Jacob', 32545),
 (2002, 'Male', 'Jacob', 30574),
 (2003, 'Male', 'Jacob', 29638),
 (2004, 'Male', 'Jacob', 27881),
 (2005, 'Male', 'Jacob', 25833),
 (2006, 'Male', 'Jacob', 24845),
 (2007, 'Male', 'Jacob', 24282),
 (2008, 'Male', 'Jacob', 22594),
 (2009, 'Male', 'Jacob', 21175),
 (2010, 'Male', 'Jacob', 22127),
 (2011, 'Male', 'Jacob', 20371),
 (2012, 'Male', 'Jacob', 19074)]

In [51]:
%%sql
-- returns countries with missing land obs
SELECT * FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CUW', 'Curacao', 'Latin America & Caribbean', 'High income', None),
 ('MAF', 'St. Martin (French part)', 'Latin America & Caribbean', 'High income', None),
 ('MCO', 'Monaco', 'Europe & Central Asia', 'High income', None),
 ('SDN', 'Sudan', 'Sub-Saharan Africa', 'Lower middle income', None),
 ('SSD', 'South Sudan', 'Sub-Saharan Africa', 'Low income', None),
 ('SXM', 'Sint Maarten (Dutch part)', 'Latin America & Caribbean', 'High income', None),
 ('XKX', 'Kosovo', 'Europe & Central Asia', 'Upper middle income', None)]

In [56]:
%%sql
-- returns countries that all include land obs
SELECT * FROM countries
WHERE land IS NOT NULL
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [59]:
%%sql
-- count how many rows exist in the entire countries table?
SELECT COUNT(*) AS total_obs FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(217,)]

In [62]:
%%sql
-- count how many countries there are with missing land obs?
SELECT COUNT(*) AS missing_land FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(7,)]

In [65]:
%%sql
-- how many unique baby names exist in the topnames table?
SELECT COUNT(DISTINCT name) AS num_unique_names FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(18,)]

In [66]:
%%sql
-- return unique baby names in the topnames table
SELECT DISTINCT(name) FROM topnames

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('Mary',),
 ('John',),
 ('Robert',),
 ('James',),
 ('Linda',),
 ('Michael',),
 ('David',),
 ('Lisa',),
 ('Jennifer',),
 ('Jessica',),
 ('Ashley',),
 ('Emily',),
 ('Jacob',),
 ('Emma',),
 ('Isabella',),
 ('Sophia',),
 ('Noah',),
 ('Liam',)]

In [68]:
%%sql
--create a new column named land_miles that contain miles squared values converted from the
-- km2 observations contained in the column "land"
SELECT *, land*0.3861 AS land_miles FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 69.498),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 252069.246),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 481350.87),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 10579.14),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 181.467)]

In [70]:
%%sql
-- create binary variable called large_country that equals 1 if land > 1000000
SELECT *, land>1000000 AS large_country FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 1),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 0)]

In [71]:
'Aruba' + ' ' + '(ABW)'

'Aruba (ABW)'

In [74]:
%%sql
-- create a new column called country2 that takes the form of 'country (code)'
-- + is "||" in SQL
SELECT *, country || ' (' || code || ')' AS country2 FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 'Aruba (ABW)'),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 'Afghanistan (AFG)'),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 'Angola (AGO)'),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 'Albania (ALB)'),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 'Andorra (AND)')]

In [79]:
%%sql
-- subqueries
-- return a table that contains the total number of obs and the number of missing land values
-- in the countries table
SELECT COUNT(*) AS total_obs, 
(SELECT COUNT(*) FROM countries WHERE land IS NULL) AS missing_land FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(217, 7)]

In [84]:
%%sql
-- find the average land in countries table?
SELECT ROUND(AVG(land),2) AS avg_land FROM countries

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(606227.81,)]

In [ ]:
%%sql
-- another subquery practice:
-- filter the countries table such that the table returned only contains countries whose land
-- obs are larger than the average land obs in the table